niamster/ChibiOS/os/hal/platforms/MIPS-PIC32MX/mcu/pic32mxxx.h
/*-------------------------------------------------------------------------
 * MPLAB-Cxx  PIC32MXGENERIC processor header
 *
 * (c) Copyright 1999-2106 Microchip Technology, All rights reserved
 *-------------------------------------------------------------------------*/

#ifndef __PIC32MXXX_H
#define __PIC32MXXX_H

#if defined(__32MX110F016B__)
#include "mcu/p32mx110f016b.h"
#elif defined(__32MX110F016C__)
#include "mcu/p32mx110f016c.h"
#elif defined(__32MX110F016D__)
#include "mcu/p32mx110f016d.h"
#elif defined(__32MX120F032B__)
#include "mcu/p32mx120f032b.h"
#elif defined(__32MX120F032C__)
#include "mcu/p32mx120f032c.h"
#elif defined(__32MX120F032D__)
#include "mcu/p32mx120f032d.h"
#elif defined(__32MX130F064B__)
#include "mcu/p32mx130f064b.h"
#elif defined(__32MX130F064C__)
#include "mcu/p32mx130f064c.h"
#elif defined(__32MX130F064D__)
#include "mcu/p32mx130f064d.h"
#elif defined(__32MX150F128B__)
#include "mcu/p32mx150f128b.h"
#elif defined(__32MX150F128C__)
#include "mcu/p32mx150f128c.h"
#elif defined(__32MX150F128D__)
#include "mcu/p32mx150f128d.h"
#elif defined(__32MX210F016B__)
#include "mcu/p32mx210f016b.h"
#elif defined(__32MX210F016C__)
#include "mcu/p32mx210f016c.h"
#elif defined(__32MX210F016D__)
#include "mcu/p32mx210f016d.h"
#elif defined(__32MX220F032B__)
#include "mcu/p32mx220f032b.h"
#elif defined(__32MX220F032C__)
#include "mcu/p32mx220f032c.h"
#elif defined(__32MX220F032D__)
#include "mcu/p32mx220f032d.h"
#elif defined(__32MX230F064B__)
#include "mcu/p32mx230f064b.h"
#elif defined(__32MX230F064C__)
#include "mcu/p32mx230f064c.h"
#elif defined(__32MX230F064D__)
#include "mcu/p32mx230f064d.h"
#elif defined(__32MX250F128B__)
#include "mcu/p32mx250f128b.h"
#elif defined(__32MX250F128C__)
#include "mcu/p32mx250f128c.h"
#elif defined(__32MX250F128D__)
#include "mcu/p32mx250f128d.h"
#elif defined(__32MX320F032H__)
#include "mcu/p32mx320f032h.h"
#elif defined(__32MX320F064H__)
#include "mcu/p32mx320f064h.h"
#elif defined(__32MX320F128H__)
#include "mcu/p32mx320f128h.h"
#elif defined(__32MX320F128L__)
#include "mcu/p32mx320f128l.h"
#elif defined(__32MX330F064H__)
#include "mcu/p32mx330f064h.h"
#elif defined(__32MX330F064L__)
#include "mcu/p32mx330f064l.h"
#elif defined(__32MX340F128H__)
#include "mcu/p32mx340f128h.h"
#elif defined(__32MX340F128L__)
#include "mcu/p32mx340f128l.h"
#elif defined(__32MX340F256H__)
#include "mcu/p32mx340f256h.h"
#elif defined(__32MX340F512H__)
#include "mcu/p32mx340f512h.h"
#elif defined(__32MX350F128H__)
#include "mcu/p32mx350f128h.h"
#elif defined(__32MX350F128L__)
#include "mcu/p32mx350f128l.h"
#elif defined(__32MX350F256H__)
#include "mcu/p32mx350f256h.h"
#elif defined(__32MX350F256L__)
#include "mcu/p32mx350f256l.h"
#elif defined(__32MX360F256L__)
#include "mcu/p32mx360f256l.h"
#elif defined(__32MX360F512L__)
#include "mcu/p32mx360f512l.h"
#elif defined(__32MX420F032H__)
#include "mcu/p32mx420f032h.h"
#elif defined(__32MX430F064H__)
#include "mcu/p32mx430f064h.h"
#elif defined(__32MX430F064L__)
#include "mcu/p32mx430f064l.h"
#elif defined(__32MX440F128H__)
#include "mcu/p32mx440f128h.h"
#elif defined(__32MX440F128L__)
#include "mcu/p32mx440f128l.h"
#elif defined(__32MX440F256H__)
#include "mcu/p32mx440f256h.h"
#elif defined(__32MX440F512H__)
#include "mcu/p32mx440f512h.h"
#elif defined(__32MX450F128H__)
#include "mcu/p32mx450f128h.h"
#elif defined(__32MX450F128L__)
#include "mcu/p32mx450f128l.h"
#elif defined(__32MX450F256H__)
#include "mcu/p32mx450f256h.h"
#elif defined(__32MX450F256L__)
#include "mcu/p32mx450f256l.h"
#elif defined(__32MX460F256L__)
#include "mcu/p32mx460f256l.h"
#elif defined(__32MX460F512L__)
#include "mcu/p32mx460f512l.h"
#elif defined(__32MX534F064H__)
#include "mcu/p32mx534f064h.h"
#elif defined(__32MX534F064L__)
#include "mcu/p32mx534f064l.h"
#elif defined(__32MX564F064H__)
#include "mcu/p32mx564f064h.h"
#elif defined(__32MX564F064L__)
#include "mcu/p32mx564f064l.h"
#elif defined(__32MX564F128H__)
#include "mcu/p32mx564f128h.h"
#elif defined(__32MX564F128L__)
#include "mcu/p32mx564f128l.h"
#elif defined(__32MX575F256H__)
#include "mcu/p32mx575f256h.h"
#elif defined(__32MX575F256L__)
#include "mcu/p32mx575f256l.h"
#elif defined(__32MX575F512H__)
#include "mcu/p32mx575f512h.h"
#elif defined(__32MX575F512L__)
#include "mcu/p32mx575f512l.h"
#elif defined(__32MX664F064H__)
#include "mcu/p32mx664f064h.h"
#elif defined(__32MX664F064L__)
#include "mcu/p32mx664f064l.h"
#elif defined(__32MX664F128H__)
#include "mcu/p32mx664f128h.h"
#elif defined(__32MX664F128L__)
#include "mcu/p32mx664f128l.h"
#elif defined(__32MX675F256H__)
#include "mcu/p32mx675f256h.h"
#elif defined(__32MX675F256L__)
#include "mcu/p32mx675f256l.h"
#elif defined(__32MX675F512H__)
#include "mcu/p32mx675f512h.h"
#elif defined(__32MX675F512L__)
#include "mcu/p32mx675f512l.h"
#elif defined(__32MX695F512H__)
#include "mcu/p32mx695f512h.h"
#elif defined(__32MX695F512L__)
#include "mcu/p32mx695f512l.h"
#elif defined(__32MX764F128H__)
#include "mcu/p32mx764f128h.h"
#elif defined(__32MX764F128L__)
#include "mcu/p32mx764f128l.h"
#elif defined(__32MX775F256H__)
#include "mcu/p32mx775f256h.h"
#elif defined(__32MX775F256L__)
#include "mcu/p32mx775f256l.h"
#elif defined(__32MX775F512H__)
#include "mcu/p32mx775f512h.h"
#elif defined(__32MX775F512L__)
#include "mcu/p32mx775f512l.h"
#elif defined(__32MX795F512H__)
#include "mcu/p32mx795f512h.h"
#elif defined(__32MX795F512L__)
#include "mcu/p32mx795f512l.h"
#else
#error Unknown PIC32MX MCU
#endif

#endif
